<template>
  <div class="page-container">
    <div class="page-header">
      <h1>Документация</h1>
      <p>Сдесь вы сможете ознакомица с инструкцией по созданию трансляций</p>
    </div>

    <div class="steps-container">
      <h3 class="step-title">Заполнение полей трансляции</h3>
      <div class="step-description">
        <p>1) Поле “Название комнаты” - Заголовок который будет отображаться в верхней части на странице вышей трансляцией.</p>
        <p>2) Поле “Ссылка на трансляцию” - В это поле вы вставляете YouTube ссылку на вашу трансляцию. Более детально вы сможете узнать в пункте “Создание YuoTube трансляции”.</p>
        <p>3) Поле “Ссылка на трансляцию со спикерами” - В это поле вы вставляете YouTube ссылку на другую трансляцию если такова опция требуется. Поле являеться не обязательным для заполнения.</p>
        <p>4) Поле “Дата трансляции” - Это поле в котором вы выбираете дату проведения трансляции. </p>
        <p>5) Поле “Другой язык” - В этом поле вы вставляете ссылку на YouTube трансляции с другим язиком.  Поле являеться не обязательным для заполнения.</p>
      </div>
    </div>

    <div class="steps-container">
      <h3 class="step-title">Заполнение полей страница рекламмы</h3>
      <div class="step-description">
        <p>Если у вас нет товара или ссылок для рекламмы вы можете пропустить эту функцию.</p>
        <p>1) Поле “Название позиции” - Заголовок товара или его название.</p>
        <p>2) Поле “Название позиции ссылка” - добавляет ссылку на поле “Название позиции”.</p>
        <p>3) Поле “Ссылки на кнопку” - добавляет кнопку с ваставленной в поле ссылкой.</p>
        <p>4) Поле “Картинка товара” - добавляет изображение к карточке товара.</p>
      </div>
    </div>

    <div class="steps-container">
      <h3 class="step-title">Заполнение полей опций</h3>
      <div class="step-description">
        <p>1) Орция “Показать чат” - Скрывает или показывает чат на странице трансляции.</p>
        <p>2) Орция “Показать предупредительный текст” - При поставленной галочке показывает два поля для ввода текста “Предупредительный заголовок” и “Предупредительный текст”, Заполнив которые пользователь при попадании на страницу увидит только содержание поля “Предупредительный заголовок” и “Предупредительный текст”.</p>
        <p>3) Орция “Загрузить изображение (Сверху)” - Позволяет вам загружать изображение для верхней части трансляции будь то спонсоры трансляции или ваш логотип.</p>
        <p>4) Орция “Загрузить изображение (Снизу)” - Позволяет вам загружать изображение для нижней части трансляции будь то спонсоры трансляции или ваш логотип.</p>
      </div>
    </div>
    
    <div class="steps-container">
      <h3 class="step-title">Заполнение полей спикера</h3>
      <div class="step-description">
        <p>Заполнение этих полей является не обязательным, так что если у вас нет спикеров которые будут проводить трансляцию или если вы хотите сохранить это в тайне, просто оставте эти поля пустыми. Так же спикеров может быть сколько угодно.</p>
        <p>1) Поле “Имя спикера” - В это поле вы вводите имя особы которая будет проводить трансляцию.</p>
        <p>2) Поле “Должность спикера” - В это поле вы вводите должность особы которая будет проводить трансляцию.</p>
        <p>3) Поле “Тема спикера” - В это поле вы вводите тему особы которая будет проводить трансляцию. Поле являеться не обязательным для заполнения. </p>
        <p>4) Поле “Время спикера” - В это поле вы вводите время данное на выступление ведущей особы. Поле являеться не обязательным для заполнения. </p>
        <p>5) Поле “LinkedIn спикера” - В это поле вы вводите ссылку на LinkedIn ведущей особы. Поле являеться не обязательным для заполнения. </p>
        <p>6) Кнопка “Фото спикера” - Суда вы можете вставить изображение ведущей особы, в случее если вы не вставите картинку на странице трансляции будет отображаться картинка анонимного человека. Поле являеться не обязательным для заполнения. </p>
      </div>
    </div>

    <div class="steps-container">
      <h3 class="step-title">Создание YuoTube трансляции</h3>
      <div class="step-description">
        <p>1) Для того что бы создать трансляцию вам нужно зайти на YuoTube, нажать на кнопку “Создать” (Правый верхний угол) а за тем нажать на кнопку “Начать трансляцию”.</p>
        <p>2) Настройте параметры трансляции под себя и добавьте “Ключ трансляции” в “Програму для вещания”</p>
        <p>3) После всех настроек нажмите на кнопку “Поделиться” (Правый верхний угол) а за тем скопируйте ссылку как показано на фото ниже.</p>
        <div class="step-image">
          <img src="../assets/shere.png" alt="Yuotube Поделиться">
        </div>
        <p>4) Вставте скопированную вами ранее ссылку в поле на платформе  “Ссылка на трансляцию”.</p>
      </div>
    </div>

  </div>
</template>

<script>
export default {

}
</script>
